digitalloggers/plduino-arduinoide-package/PLDuinoESP/boards.txt
PLDuinoESP.name=PLDuino/ESP-02

PLDuinoESP.upload.tool=esptool-plduino
PLDuinoESP.upload.speed=115200
PLDuinoESP.upload.resetmethod=ck
PLDuinoESP.upload.maximum_size=1044464
PLDuinoESP.upload.maximum_data_size=81920
PLDuinoESP.upload.wait_for_upload_port=true

PLDuinoESP.build.mcu=esp8266
PLDuinoESP.build.f_cpu=80000000L
PLDuinoESP.build.board=PLDuinoESP
PLDuinoESP.build.core=esp8266:esp8266
PLDuinoESP.build.variant=PLDuinoESP
PLDuinoESP.build.flash_mode=qio
PLDuinoESP.build.flash_size=4M
PLDuinoESP.build.flash_ld=eagle.flash.4m.ld
PLDuinoESP.build.spiffs_start=0x100000
PLDuinoESP.build.spiffs_end=0x3FB000
PLDuinoESP.build.spiffs_blocksize=8192
PLDuinoESP.upload.maximum_size=1044464
PLDuinoESP.build.spiffs_pagesize=256
PLDuinoESP.build.flash_freq=40

PLDuinoESP.build.debug_port=
PLDuinoESP.build.debug_level=
